<template>
    <div class="footer">
        <div class="footer-columns">
            <div class="footer-col-one">
                <h3> Тендеры </h3>
                <button class="footer-col-one-button">
                    Добавить тендер
                </button>
                <p>
                    Каталог тендеров<br>
                    Работа с клиентами<br>
                    Упраление проектами<br>
                    Маркетинг<br>
                    Финансы<br>
                    Управление бизнесом<br>
                </p>
            </div>
            <div class="footer-col-two">
                <h3> Компании </h3>
                <button class="footer-col-two-button">
                    Добавить компанию
                </button>
                <p>
                    Каталог тендеров<br>
                    Работа с клиентами<br>
                    Упраление проектами<br>
                    Маркетинг<br>
                    Финансы<br>
                    Управление бизнесом<br>
                </p>
            </div>
            <div class="footer-col-three">
                <h3> Продукты </h3>
                <p>
                    Рейтинги<br>
                    По отраслям<br>
                    Работа с клиентами<br>
                    Управление проектами<br>
                    Маркетинг<br>
                    Финансы<br>
                    Управление бизнесом
                </p>
            </div>
            <div class="footer-col-four">
                <h3> Кейсы </h3>
                <p>
                    Каталог тендеров<br>
                    Работа с клиентами<br>
                    Упраление проектами<br>
                    Маркетинг<br>
                    Финансы<br>
                    Управление бизнесом<br>
                </p>
            </div>
        </div>
        <br>
        <div class="footer-bottom">
            <a href="https://ru-ru.facebook.com">
            <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M24.0004 12.8751C24.0004 6.24708 18.6283 0.875 12.0003 0.875C5.37232 0.875 0.000244141 6.24708 0.000244141 12.8751C0.000244141 18.8652 4.38602 23.8296 10.1263 24.7305V16.3469H7.08192V12.8751H10.1263V10.2318C10.1263 7.22681 11.9148 5.56324 14.6568 5.56324C15.9718 5.56324 17.3461 5.79995 17.3461 5.79995V8.7523H15.8337C14.3411 8.7523 13.8809 9.67943 13.8809 10.6263V12.8751H17.208L16.6754 16.3469H13.8809V24.7305C19.6146 23.8296 24.0004 18.8652 24.0004 12.8751Z" fill="#1877F2"/>
            </svg>
            </a>
            <span style='padding-left:25px;'> </span>
            <a href="https://vk.com">
                <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0.000244141 12.375C0.000244141 6.95385 0.000244141 4.24327 1.68438 2.55913C3.36851 0.875 6.07909 0.875 11.5002 0.875H12.5002C17.9214 0.875 20.632 0.875 22.3161 2.55913C24.0002 4.24327 24.0002 6.95385 24.0002 12.375V13.375C24.0002 18.7962 24.0002 21.5067 22.3161 23.1908C20.632 24.875 17.9214 24.875 12.5002 24.875H11.5002C6.07909 24.875 3.36851 24.875 1.68438 23.1908C0.000244141 21.5067 0.000244141 18.7962 0.000244141 13.375L0.000244141 12.375Z" fill="#2787F5"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M6.5007 8.375H4.7503C4.25018 8.375 4.15015 8.6104 4.15015 8.8699C4.15015 9.33345 4.74358 11.6324 6.91325 14.6729C8.3597 16.7494 10.3976 17.875 12.252 17.875C13.3647 17.875 13.5023 17.625 13.5023 17.1944V15.625C13.5023 15.125 13.6077 15.0252 13.96 15.0252C14.2197 15.0252 14.6647 15.155 15.7032 16.1561C16.8901 17.3427 17.0857 17.875 17.7533 17.875H19.5037C20.0038 17.875 20.2539 17.625 20.1096 17.1317C19.9518 16.64 19.3851 15.9265 18.6332 15.0808C18.2252 14.5988 17.6133 14.0797 17.4278 13.8201C17.1682 13.4864 17.2424 13.338 17.4278 13.0414C17.4278 13.0414 19.5604 10.038 19.783 9.0183C19.8942 8.64745 19.783 8.375 19.2536 8.375H17.5032C17.0582 8.375 16.853 8.6104 16.7417 8.8699C16.7417 8.8699 15.8516 11.0391 14.5906 12.4481C14.1826 12.856 13.9971 12.9858 13.7746 12.9858C13.6633 12.9858 13.5023 12.856 13.5023 12.4853V9.0183C13.5023 8.5733 13.3731 8.375 13.0022 8.375H10.2515C9.97345 8.375 9.80615 8.5815 9.80615 8.77725C9.80615 9.19905 10.4366 9.29635 10.5016 10.4829V13.06C10.5016 13.625 10.3995 13.7275 10.177 13.7275C9.58365 13.7275 8.1402 11.5486 7.2841 9.05535C7.11635 8.57075 6.94805 8.375 6.5007 8.375Z" fill="white"/>
                </svg>
            </a>
            <span style='padding-left:25px;'> </span>
            <a href="https://youtube.com">
                <svg width="25" height="18" viewBox="0 0 25 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0.638532 3.93168C0.748701 2.23559 2.11234 0.90636 3.80993 0.822257C6.26814 0.70047 9.78165 0.553589 12.429 0.553589C15.0763 0.553589 18.5898 0.70047 21.048 0.822257C22.7456 0.90636 24.1092 2.23559 24.2194 3.93168C24.3249 5.55667 24.429 7.55615 24.429 9.12502C24.429 10.6939 24.3249 12.6934 24.2194 14.3184C24.1092 16.0144 22.7456 17.3437 21.048 17.4278C18.5898 17.5496 15.0763 17.6964 12.429 17.6964C9.78165 17.6964 6.26814 17.5496 3.80993 17.4278C2.11234 17.3437 0.748701 16.0144 0.638532 14.3184C0.532981 12.6934 0.428955 10.6939 0.428955 9.12502C0.428955 7.55615 0.532981 5.55667 0.638532 3.93168Z" fill="#FC0D1B"/>
                    <path d="M9.85754 5.69641V12.5536L16.7147 9.12498L9.85754 5.69641Z" fill="white"/>
                </svg>
            </a>
            <p>О проекте<span style='padding-left:50px;'> </span>Пользовательское соглашение</p>
        </div>
    </div>
</template>

<style scoped>
.footer{
    bottom: 0;
    left: 0;
    margin-left: -8px;
    width: 100%;
    max-height: 384px;
    border-top: 1px solid #E5E5E5;
}
h3{
    margin-left: 50px;
}
.footer button{
    margin-left: 50px;
    border: none;
    font-weight: 400;
    font-size: 14px;
    border-radius: 4px;
    color: white;
    width: 152px;
    height: 32px;
}
.footer-col-one-button {
    background: #030953;
}
.footer-col-two-button {
    background: #EF3E4A;
}
.footer-columns p{
    font-weight: 400;
    font-size: 14px;
    margin-left: 50px;
    margin-top: 30px;
    line-height: 32px;
}
.footer-columns{
    display: flex;
    flex-wrap: wrap;
    justify-content: center;
}
.footer-columns div{
    padding: 25px 40px 0 40px;
}
.footer-bottom{
  float: bottom;
  flex-wrap: wrap;
  color: #999;
  height: 100%;
  padding: 0 10% 0 20%;
}
.footer-bottom p{
    float: right;
    margin-right: 50px;
    font-size: 12px;
    color: #808080;
}
</style>